Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox.ToString Method
 Returns the rectangle bounding box values as a string.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The rectangle bounding box values as a string.
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace